In [2]:
import pandas as pd

In [6]:
# Pandas is a cool library for data analysis, manipulation and exploration. In Pandas, we generally use Dataframes and work with tabular data.
# It helps us to explore clean and process data.

# dataframe is a type of tabular format that is used to represent data in tabular form in python. In this we can give names to cols and rows/index.
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=['a', 'b', 'c'], index=['row1', 'row2', 'row3'])
df

      a  b  c
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [ ]:
df.head(1)
# shows us the first 5 rows of the dataframe if number not mentioned.

df.tail(2)
# shows us the last 5 rows of the dataframe if number not mentioned.

      a  b  c
row2  4  5  6
row3  7  8  9

In [17]:
df.index.to_list()
df.index
df.info()

df.nunique()
df['a'].nunique()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

3

In [19]:
df.shape

(3, 3)

In [20]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [22]:
coffee = pd.read_csv('warmup_data/coffee.csv')
coffee.head()

         Day  Coffee Type   Units Sold Monday   Espresso   25
0     Monday        Latte                  15        NaN  NaN
1    Tuesday     Espresso                  30        NaN  NaN
2    Tuesday        Latte                  20        NaN  NaN
3  Wednesday     Espresso                  35        NaN  NaN
4  Wednesday        Latte                  25        NaN  NaN